title: ChromeLoader Malware
description: Detects instances of the Chrome browser executable spawning from PowerShell with a corresponding command line that includes appdata\local as a parameter.
status: experimental
references:
  - https://blogs.vmware.com/security/2022/09/the-evolution-of-the-chromeloader-malware.html
  - https://unit42.paloaltonetworks.com/chromeloader-malware/
  - https://redcanary.com/blog/chromeloader/
author: threatHNTR
date: 10/10/2022
tags:
  - attack.persistence
  - attack.T1176
  - attack.T1059.001
logsource:
  category: process_creation
  product: windows
detection:
    parent_process:
      ParentImage|contains: 
        - 'powershell.exe'
        - 'pwsh.exe'
    process:
      Image|contains:
        - 'chrome.exe'
    commandline1:
      CommandLine|contains:
        - '--load-extension='
    commandline2:
      CommandLine|contains:
        - '\AppData\Local\*'
    condition: parent_process and process and commandline1 and commandline2
falsepositives:
  - unknown
level: high
