title: F5 BIG-IP iControl REST Vulnerability (CVE-2022-1388)
description: Detect remote code execution on on vulnerable F5 BIG-IP devices. 
status: experimental
references:
    - https://support.f5.com/csp/article/K23605346
    - https://www.cisa.gov/uscert/sites/default/files/publications/AA22-138A-Threat_Actors_Exploiting_F5_BIG-IP_CVE-2022-1388_F5.pdf

author: threatHNTR
date: 2022/06/17
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: webserver
detection:
    selection1:
        c-uri:
            - '/mgmt/tm/util/bash'
    selection2:
        c-uri|contains:
            - 'command'
            - 'utilCmdArgs'
    selection3:
        sc-status:
            - '200'
    selection4:
        cs_method:
            - 'POST'
    condition: selection1 and selection2 and selection3 and selection4
falsepositives:
    - unknown
level: high
