title: Attempted Exploitation of CVE-2024-23897
id: de426754-5bbb-408c-aaa1-114e2620c7e5
status: experimental
author: threatHNTR
date: 2024/01/29
description: Detects potential exploitation attempts for CVE-2024-23897 (Jenkins Data Leak Vulnerability) to access unauthorized files on the Jenkins controller file system, potentially leading to Remote Code Execution (RCE).
references:
  - https://nvd.nist.gov/vuln/detail/CVE-2024-23897
  - https://www.jenkins.io/security/advisory/2024-01-24/
  - https://github.com/h4x0r-dz/CVE-2024-23897
  - https://github.com/binganao/CVE-2024-23897
tags:
  - cve.2024.23897
  - attack.t1190
  - attack.initial_access
  - attack.t1210
  - attack.lateral_movement
logsource:
  category: webserver
detection:
  selection:
    cs-method: 'POST'
    c-uri|contains: 'cli\?remoting=false'
  condition: selection
falsepositives:
  - Unknown
level: high
